#ifndef USBD_UVC_DESC_H
#define USBD_UVC_DESC_H

#include "core/inc/usb_config.h"
#include "core/inc/usb_composite.h"
#include "osdep_service.h"

#include "uvc_os_wrap_via_osdep_api.h"
#include "usb.h"
#include "basic_types.h"
#include "video.h"

#define DBG_8195A printf

#define VALUE_FPS(fps) (10000000/fps)

#define FORMAT_TYPE_YUY2        0
#define FORMAT_TYPE_NV12        1
#define FORMAT_TYPE_MJPEG       2
#define FORMAT_TYPE_H264        3


#define UVC_INTF_CONTROL        0
#define UVC_INTF_STREAMING      1

#define UVC_EVENT_FIRST			0//(V4L2_EVENT_PRIVATE_START + 0)
#define UVC_EVENT_CONNECT		1//(V4L2_EVENT_PRIVATE_START + 0)
#define UVC_EVENT_DISCONNECT		2//(V4L2_EVENT_PRIVATE_START + 1)
#define UVC_EVENT_STREAMON		3//(//V4L2_EVENT_PRIVATE_START + 2)
#define UVC_EVENT_STREAMOFF		4//(V4L2_EVENT_PRIVATE_START + 3)
#define UVC_EVENT_SETUP			5//(V4L2_EVENT_PRIVATE_START + 4)
#define UVC_EVENT_DATA			6//(V4L2_EVENT_PRIVATE_START + 5)
#define UVC_EVENT_LAST			7//(V4L2_EVENT_PRIVATE_START + 5)

#define USBD_UVC_DEBUG          0

#if	USBD_UVC_DEBUG
#define USBD_PRINTF(fmt, args...)		            DBG_8195A("\n\r%s: " fmt, __FUNCTION__, ## args)
#define USBD_ERROR(fmt, args...)		            DBG_8195A("\n\r%s: " fmt, __FUNCTION__, ## args)
#define USBD_WARN(fmt, args...)		            	DBG_8195A("\n\r%s: " fmt, __FUNCTION__, ## args)
//#define FUN_ENTER                                   DBG_8195A("\n\r%s ==>\n", __func__)
//#define FUN_EXIT                                    DBG_8195A("\n\r%s <==\n", __func__)
//#define FUN_TRACE                                   DBG_8195A("\n\r%s:%d \n", __func__, __LINE__)
#else
#define USBD_PRINTF(fmt, args...)
#define USBD_ERROR(fmt, args...)		            DBG_8195A("\n\r%s: " fmt, __FUNCTION__, ## args)
#define USBD_WARN(fmt, args...)
#define FUN_ENTER
#define FUN_EXIT
#define FUN_TRACE
#endif

//structure predefine
struct uvc_dev;
struct uvc_video;

#define UVC_CMD_THREAD_PRIORITY	2

//#define UVC_NUM_REQUESTS 4

#define UVC_NUM_REQUESTS			2
#define UVC_MAX_REQUEST_SIZE			64
#define UVC_MAX_EVENTS				4

//Tuning tool
#define VendorCommand   0X0A
#define VendorData      0X0B
#define VendorLength    0X08



//#define UVC_VC_PROCESS_UNIT     0X02
//#define UVC_VC_EXTENSION_UNIT   0X03

//Tuning tool structure

struct uvc_frame_info
{
	unsigned int width;
	unsigned int height;
	unsigned int intervals[4];
};

struct uvc_format_info
{
	unsigned int fcc;
	//const struct uvc_frame_info *frames;
        struct uvc_frame_info *frames;
};


#define MAKE_SUBCMD(data,dir,subcmd) ((u8)(data)<<7|(u8)(dir)<<6|subcmd)

typedef struct _UvcVendorCmd{
	unsigned char cmd;
	unsigned char subcmd;
	unsigned short address;
	unsigned short length;
	unsigned short reserved;
	unsigned char buffer[8];
}UvcVendorCmd;

typedef struct _process_unit{
	int cur;//0X81
	int min;//0X82
	int max;//0X83
	int res;//0X84
	int len;//0X85
	int info;//0X86
	int def;//0X87
}process_unit;

typedef struct _isp_usbd_cmd_data{
  	u16 cmdcode;
	u8 index;
	u8 length;
	u16 param;
	u16 addr;
	u8 buf[0x40];//The maximum buffer size
        u32 offset;//to recode the index for read and write
	//u32 error_type;
}isp_usbd_cmd_data;

struct usbd_uvc_buffer {
        struct list_head buffer_list;
	unsigned char *mem;
	unsigned int bytesused;
        void *exbuf;
};

struct uvc_video
{
	struct usb_ep *ep;
        struct usbd_uvc_buffer uvc_buffer;

	/* Frame parameters */
	u8 bpp;
	u32 fcc;
	unsigned int width;
	unsigned int height;
	unsigned int imagesize;
        unsigned int frm_type;
        

        void (*encode)(struct usb_iso_request *req, struct uvc_video *video,struct usbd_uvc_buffer *buf);
        

	/* Requests */
	unsigned int req_size;

	struct usb_iso_request *req;

	__u8 *req_buffer[UVC_NUM_REQUESTS];
	//struct list_head req_free;
	//spinlock_t req_lock;


	/* Context data used by the completion handler */
	__u32 payload_size;
	__u32 max_payload_size;

	//struct uvc_video_queue queue;
	unsigned int    fid;
        unsigned int    format;
        unsigned int    buf_used;
        
        // payload list
        struct list_head input_queue;
        struct list_head output_queue;
        _mutex input_lock;
        _mutex output_lock;
        _sema output_queue_sema;
};

struct uvc_request_data
{
	__s32 length;
	__u8 data[60];
};

struct uvc_req_data {
	__u32				type;
	union {
		struct usb_ctrlrequest req;
                struct uvc_request_data uvc_data;
		unsigned char buf[64];
	};
	_list	list;
};



struct uvc_common{
	struct msc_dev	*mscdev;

	struct usb_gadget	*gadget;
	struct usb_ep		*ep0;		
	struct usb_request	*req0;		/* for control responses */
	unsigned int 		running;
        /* bolk cmd data*/
	_mutex  bod_mutex;
	_list	bod_list;
};

//typedef void*	_lock;

struct uvc_dev{
	struct uvc_common 	*common;
        struct uvc_video        video;
        
        struct uvc_streaming_control probe;
	struct uvc_streaming_control commit;
	
	u16 		interface_number;
	u8			config;

	struct usb_ep	*in_ep;
	struct usb_ep	*out_ep;
	//unsigned int	bulk_in_enabled:1;
	//unsigned int	bulk_out_enabled:1;
        struct usb_request *control_req;
	void *control_buf;

        //const struct usb_endpoint_descriptor *in, *out, *status;
        // lock is held when accessing usb
        struct usb_function	func;
        _lock lock;
        struct task_struct uvc_CmdTask;
        struct usb_ctrlrequest req_ctrl;
        struct uvc_req_data    req_data;
        /* Events */
	unsigned int event_length;
	unsigned int event_setup_out : 1;
        int control;//control selector
        int command_interface;//Interface and entiny 0x00 control 0x01 streaming &0xff
        int command_entity;//0x02 process unit 0x03 extension unit >>8&0xff
        unsigned char result[64];
        struct uvc_req_data  *exten_temp_data;
        //UvcVendorCmd tuning_data;
        isp_usbd_cmd_data isp_data;
        void (*change_parm_cb)(void*);
};

/*-------------------------------------------------------------------------*/

/* module parameters specific to the Video streaming endpoint */
static unsigned int streaming_interval = 1;

static unsigned int streaming_maxpacket = 1000;//1024;

static unsigned int streaming_maxburst;
/* --------------------------------------------------------------------------
 * Function descriptors
 */

/* string IDs are assigned dynamically */

#define UVC_STRING_CONTROL_IDX			0
#define UVC_STRING_STREAMING_IDX		1

#define UVC_INTF_VIDEO_CONTROL			0
#define UVC_INTF_VIDEO_STREAMING		1

#define UVC_STATUS_MAX_PACKET_SIZE		16	/* 16 bytes status */

/////////////////////////////////////////////////////

